# ZoomPercentage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..ZoomPercentage Property
PDFExportOptions Class See Also
---
Percentage of the zoom for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int ZoomPercentage { get; set; }
```

Visual Basic
---
```text
Public Property ZoomPercentage As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ZoomPercentage {
	int get ();
	void set (int value);
}
```

# Remarks
This property would be ignored if the ZoomType is FitToPage.
# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace